Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/legal_aid_and_advice/index.html.txt.tmx
Source language: en
Languages: ga

source: Legal aid and advice
ga: Cabhair Dhlíthiúil agus Comhairle

source: The Legal Aid Board provides legal aid and advice in civil cases to people in Ireland who satisfy certain requirements (principally,their means must be below a certain limit and there must be merit in the case
ga: Tá cur síos anseo ar Bhord an Chúnamh Dlí

source: Civil Legal Advice and Legal Aid
ga: Comhairle agus Cúnamh Dlí

source: An explanation of civil legal advice and legal aid and the eligibility criteria to be able to avail of it
ga: Tá cur síos sa cháipéis seo ar an gcóras cúnamh dlí shibhialta in Éirinn

source: Civil legal aid and cross border disputes
ga: Cúnamh dlí sibhialta agus conspóidí trasteorann

source: If you have a legal dispute in another EU country you may be able to avail of legal aid in that country by applying to the Legal Aid Board
ga: Má tá conspóid dlí ar siúl agat i dtír eile den AE féadtar go mbeidh tú in ann leas a bhaint as cúnamh dlí sa tír sin ach iarratas a chur isteach ar an mBord um Chúnamh Dlíthiúil

source: Legal aid for asylum seekers
ga: Cúnamh dlí d'iarrthóirí tearmainn

source: Legal aid is available to people who are applying for international protection in Ireland
ga: Tá cúnamh dlí ar fáil do dhaoine in Éirinn atá ag déanamh iarratas ar stádas tearmann

source: This document is in: Moving Country > Asylum seekers and refugees > Services for asylum seekers in Ireland
ga: This document is in: Ag bogadh tíre > Dídeanaithe agus Lucht Iarrtha Tearmainn > Seirbhísí do lucht iarrtha tearmainn in Éirinn

source: Garda Station Legal Advice Revised Scheme
ga: Scéim Leasaithe um Chomhairle Dlí Stáisiún an Gharda Síochána

source: Under the Garda Station Legal Advice Revised Scheme legal advice may be provided to those detained under certain legislation in Garda stations
ga: Faoi Scéim Leasaithe um Chomhairle Dlí Stáisiún an Gharda Síochána, is féidir comhairle dlí a chur ar fáil dóibh siúd atá faoi choinneáil i stáisiúin an Gharda Síochána

source: You must fulfil certain criteria to qualify for criminal legal aid
ga: Tá cur síos anseo ar an gcóras do chúnamh dlí coiriúil in Éirinn

source: There are a range of different legal aid certificates issued in Ireland
ga: Eisítear réimse de theastais éagsúla chúnaimh dhlíthiúil in Éirinn

source: Find out what each certificate means and how to obtain one
ga: Faigh amach cad é a chiallaíonn gach teastas agus conas a fhaigheann tú teastas

source: Most Read in "Justice"
ga: Ábhar is mó éilimh i "Dlí"

source: Alcohol and the law
ga: Alcól agus an dlí
